benchmark/duckdb/results/waf-counter-lag/20260502_151805/fio_rand_1000_4k.log
fillrun: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.42-20-ga95f8
Starting 1 process
fio: only root may flush block devices. Cache flush bypassed!
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

fillrun: (groupid=0, jobs=1): err= 0: pid=305997: Sat May  2 19:15:11 2026
  write: IOPS=424k, BW=1657MiB/s (1738MB/s)(1000GiB/617903msec)
    slat (nsec): min=872, max=1483.0k, avg=1205.61, stdev=517.85
    clat (usec): min=18, max=1561, avg=73.77, stdev= 2.63
     lat (usec): min=19, max=1564, avg=74.97, stdev= 2.64
    clat percentiles (usec):
     |  1.00th=[   73],  5.00th=[   73], 10.00th=[   73], 20.00th=[   74],
     | 30.00th=[   74], 40.00th=[   74], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   75], 80.00th=[   75], 90.00th=[   76], 95.00th=[   76],
     | 99.00th=[   78], 99.50th=[   78], 99.90th=[   82], 99.95th=[   92],
     | 99.99th=[  115]
   bw (  MiB/s): min= 1629, max= 1683, per=100.00%, avg=1657.36, stdev=12.49, samples=1235
   iops        : min=417132, max=430954, avg=424284.39, stdev=3198.11, samples=1235
  lat (usec)   : 20=0.01%, 50=0.01%, 100=99.98%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=43.66%, sys=56.30%, ctx=4794, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144000,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=1657MiB/s (1738MB/s), 1657MiB/s-1657MiB/s (1738MB/s-1738MB/s), io=1000GiB (1074GB), run=617903-617903msec

Disk stats (read/write):
  nvme0n1: ios=43/262139855, sectors=2136/2097118840, merge=0/0, ticks=1/2124735, in_queue=2124737, util=99.99%