benchmark/duckdb/results/waf-counter-lag/20260502_151805/fio_rand_fill1x_4k.log
fillrun: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.42-20-ga95f8
Starting 1 process
fio: only root may flush block devices. Cache flush bypassed!
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

fillrun: (groupid=0, jobs=1): err= 0: pid=307088: Sat May  2 20:01:40 2026
  write: IOPS=420k, BW=1641MiB/s (1720MB/s)(1575GiB/983063msec)
    slat (nsec): min=877, max=1051.9k, avg=1216.40, stdev=526.35
    clat (usec): min=10, max=1168, avg=74.49, stdev= 2.57
     lat (usec): min=11, max=1169, avg=75.71, stdev= 2.56
    clat percentiles (usec):
     |  1.00th=[   73],  5.00th=[   74], 10.00th=[   74], 20.00th=[   74],
     | 30.00th=[   75], 40.00th=[   75], 50.00th=[   75], 60.00th=[   75],
     | 70.00th=[   76], 80.00th=[   76], 90.00th=[   76], 95.00th=[   77],
     | 99.00th=[   78], 99.50th=[   79], 99.90th=[   82], 99.95th=[   93],
     | 99.99th=[  114]
   bw (  MiB/s): min= 1515, max= 1664, per=100.00%, avg=1640.69, stdev= 8.76, samples=1966
   iops        : min=387874, max=426012, avg=420017.09, stdev=2242.81, samples=1966
  lat (usec)   : 20=0.01%, 50=0.01%, 100=99.98%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=44.93%, sys=55.04%, ctx=7592, majf=0, minf=26
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,412876800,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=1641MiB/s (1720MB/s), 1641MiB/s-1641MiB/s (1720MB/s-1720MB/s), io=1575GiB (1691GB), run=983063-983063msec

Disk stats (read/write):
  nvme0n1: ios=43/412805069, sectors=2136/3302440552, merge=0/0, ticks=1/3348925, in_queue=3348927, util=99.99%