benchmark/duckdb/results/waf-counter-lag/20260502_151805/fio_seq_100_4k.log
fillrun: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.42-20-ga95f8
Starting 1 process
fio: only root may flush block devices. Cache flush bypassed!
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

fillrun: (groupid=0, jobs=1): err= 0: pid=303881: Sat May  2 15:19:11 2026
  write: IOPS=440k, BW=1718MiB/s (1801MB/s)(100GiB/59609msec)
    slat (nsec): min=867, max=1069.8k, avg=1365.67, stdev=523.18
    clat (usec): min=15, max=1184, avg=70.95, stdev= 2.21
     lat (usec): min=17, max=1188, avg=72.31, stdev= 2.26
    clat percentiles (nsec):
     |  1.00th=[69120],  5.00th=[70144], 10.00th=[70144], 20.00th=[70144],
     | 30.00th=[70144], 40.00th=[70144], 50.00th=[71168], 60.00th=[71168],
     | 70.00th=[71168], 80.00th=[71168], 90.00th=[72192], 95.00th=[72192],
     | 99.00th=[74240], 99.50th=[75264], 99.90th=[77312], 99.95th=[85504],
     | 99.99th=[95744]
   bw (  MiB/s): min= 1705, max= 1728, per=100.00%, avg=1718.04, stdev= 9.11, samples=119
   iops        : min=436516, max=442550, avg=439818.49, stdev=2331.60, samples=119
  lat (usec)   : 20=0.01%, 50=0.01%, 100=99.99%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=37.60%, sys=62.37%, ctx=468, majf=0, minf=19
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,26214400,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=1718MiB/s (1801MB/s), 1718MiB/s-1718MiB/s (1801MB/s-1801MB/s), io=100GiB (107GB), run=59609-59609msec

Disk stats (read/write):
  nvme0n1: ios=43/26122452, sectors=2136/208979616, merge=0/0, ticks=1/211966, in_queue=211968, util=99.84%