benchmark/duckdb/results/waf-counter-lag/20260502_151805/fio_seq_fill1x_4k.log
fillrun: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.42-20-ga95f8
Starting 1 process
fio: only root may flush block devices. Cache flush bypassed!
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

fillrun: (groupid=0, jobs=1): err= 0: pid=304753: Sat May  2 16:45:05 2026
  write: IOPS=438k, BW=1712MiB/s (1796MB/s)(1575GiB/941853msec)
    slat (nsec): min=872, max=1067.8k, avg=1318.71, stdev=516.88
    clat (usec): min=12, max=1192, avg=71.19, stdev= 2.29
     lat (usec): min=13, max=1194, avg=72.51, stdev= 2.34
    clat percentiles (nsec):
     |  1.00th=[70144],  5.00th=[70144], 10.00th=[70144], 20.00th=[70144],
     | 30.00th=[71168], 40.00th=[71168], 50.00th=[71168], 60.00th=[71168],
     | 70.00th=[71168], 80.00th=[71168], 90.00th=[72192], 95.00th=[73216],
     | 99.00th=[74240], 99.50th=[75264], 99.90th=[77312], 99.95th=[85504],
     | 99.99th=[99840]
   bw (  MiB/s): min= 1700, max= 1724, per=100.00%, avg=1712.51, stdev= 4.62, samples=1883
   iops        : min=435340, max=441368, avg=438402.81, stdev=1181.54, samples=1883
  lat (usec)   : 20=0.01%, 50=0.01%, 100=99.99%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=38.68%, sys=61.29%, ctx=7231, majf=0, minf=26
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,412876800,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=1712MiB/s (1796MB/s), 1712MiB/s-1712MiB/s (1796MB/s-1796MB/s), io=1575GiB (1691GB), run=941853-941853msec

Disk stats (read/write):
  nvme0n1: ios=43/412787004, sectors=2136/3302296032, merge=0/0, ticks=1/3341264, in_queue=3341265, util=100.00%